{
	"vid": "101f0aae-52d1-11e2-87fe-f4ce46b9ace8",
	"topic": "puppet -- multiple vulnerabilities",
	"affects": [
		{
			"name": [
				"puppet"
			],
			"range": [
				{
					"lt": "2.6.17",
					"gt": "2.6.*"
				}
			]
		}
	],
	"description": {
		"xmlns": "http://www.w3.org/1999/xhtml",
		"text": "\n\t<p>puppet -- multiple vulnerabilities</p>\n\t<blockquote cite=\"http://projects.puppetlabs.com/projects/puppet/wiki/Release_Notes#2.6.17\">\n\t  <p>Arbitrary file read on the puppet master from authenticated clients (high). It is possible to construct an HTTP get request from an authenticated client with a valid certificate that will return the contents of an arbitrary file on the Puppet master that the master has read-access to.</p>\n\t  <p>Arbitrary file delete/D.O.S on Puppet Master from authenticated clients (high). Given a Puppet master with the \"Delete\" directive allowed in auth.conf for an authenticated host, an attacker on that host can send a specially crafted Delete request that can cause an arbitrary file deletion on the Puppet master, potentially causing a denial of service attack. Note that this vulnerability does *not* exist in Puppet as configured by default.</p>\n\t  <p>Insufficient input validation for agent hostnames (low). An attacker could trick the administrator into signing an attacker's certificate rather than the intended one by constructing specially crafted certificate requests containing specific ANSI control sequences. It is possible to use the sequences to rewrite the order of text displayed to an administrator such that display of an invalid certificate and valid certificate are transposed. If the administrator signs the attacker's certificate, the attacker can then man-in-the-middle the agent.</p>\n\t</blockquote>\n      "
	},
	"references": {
		"url": [
			"http://projects.puppetlabs.com/projects/puppet/wiki/Release_Notes#2.6.17",
			"http://puppetlabs.com/security/cve/cve-2012-3864/",
			"http://puppetlabs.com/security/cve/cve-2012-3865/",
			"http://puppetlabs.com/security/cve/cve-2012-3867/"
		],
		"cvename": [
			"CVE-2012-3864",
			"CVE-2012-3865",
			"CVE-2012-3867"
		]
	},
	"dates": {
		"discovery": "2012-07-10",
		"entry": "2012-12-30"
	}
}
