{
	"vid": "20006b5f-a0bc-11eb-8ae6-fc4dd43e2b6a",
	"topic": "Apache Maven -- multiple vulnerabilities",
	"affects": [
		{
			"name": [
				"maven"
			],
			"range": [
				{
					"lt": "3.8.1"
				}
			]
		}
	],
	"description": {
		"xmlns": "http://www.w3.org/1999/xhtml",
		"text": "\n\t<p>The Apache Maven project reports:</p>\n\t<blockquote cite=\"http://maven.apache.org/docs/3.8.1/release-notes.html#cve-2021-26291\">\n\t  <p>We received a report from Jonathan Leitschuh about a vulnerability\n\t    of custom repositories in dependency POMs. We've split this up\n\t    into three separate issues:</p>\n\t  <ul>\n\t    <li>Possible Man-In-The-Middle-Attack due to custom repositories\n\t    using HTTP.\n\n\t    More and more repositories use HTTPS nowadays, but this\n\t    hasn't always been the case. This means that Maven Central contains\n\t    POMs with custom repositories that refer to a URL over HTTP. This\n\t    makes downloads via such repository a target for a MITM attack. At\n\t    the same time, developers are probably not aware that for some\n\t    downloads an insecure URL is being used. Because uploaded POMs to\n\t    Maven Central are immutable, a change for Maven was required. To\n\t    solve this, we extended the mirror configuration with blocked\n\t    parameter, and we added a new external:http:* mirror selector (like\n\t    existing external:*), meaning \"any external URL using HTTP\".\n\n\t    The decision was made to block such external HTTP repositories by default:\n\t    this is done by providing a mirror in the conf/settings.xml blocking\n\t    insecure HTTP external URLs.</li>\n\t    <li>Possible Domain Hijacking due to custom repositories using abandoned\n\t    domains\n\n\t    Sonatype has analyzed which domains were abandoned and has claimed these\n\t    domains.</li>\n\t    <li>Possible hijacking of downloads by redirecting to custom repositories\n\n\t    This one was the hardest to analyze and explain. The short story is:\n\t    you're safe, dependencies are only downloaded from repositories within\n\t    their context. So there are two main questions: what is the context and\n\t    what is the order? The order is described on the Repository Order page.\n\t    The first group of repositories are defined in the settings.xml (both user\n\t    and global). The second group of repositories are based on inheritence,\n\t    with ultimately the super POM containing the URL to Maven Central. The\n\t    third group is the most complex one but is important to understand the\n\t    term context: repositories from the effective POMs from the dependency\n\t    path to the artifact. So if a dependency was defined by another dependency\n\t    or by a Maven project, it will also include their repositories. In the end\n\t    this is not a bug, but a design feature.</li>\n\t  </ul>\n\t</blockquote>\n      "
	},
	"references": {
		"url": [
			"http://maven.apache.org/docs/3.8.1/release-notes.html#cve-2021-26291"
		],
		"cvename": [
			"CVE-2021-26291",
			"CVE-2020-13956"
		]
	},
	"dates": {
		"discovery": "2021-04-04",
		"entry": "2021-04-19"
	}
}
