{
  "vid": "3a429192-c36a-11e2-97a9-6805ca0b3d42",
  "topic": "RT -- multiple vulnerabilities",
  "affects": [
    {
      "name": [
        "rt38"
      ],
      "range": [
        {
          "lt": "3.8.17",
          "ge": "3.8"
        }
      ]
    },
    {
      "name": [
        "rt40"
      ],
      "range": [
        {
          "lt": "4.0.13",
          "ge": "4.0"
        }
      ]
    }
  ],
  "description": {
    "xmlns": "http://www.w3.org/1999/xhtml",
    "text": "\n\t<p>Thomas Sibley reports:</p>\n\t<blockquote cite=\"http://lists.bestpractical.com/pipermail/rt-announce/2013-May/000226.html\">\n\t  <p>We discovered a number of security vulnerabilities which\n\t  affect both RT 3.8.x and RT 4.0.x.  We are releasing RT\n\t  versions 3.8.17 and 4.0.13 to resolve these vulnerabilities,\n\t  as well as patches which apply atop all released versions of\n\t  3.8 and 4.0.</p>\n\t  <p>The vulnerabilities addressed by 3.8.17, 4.0.13, and the\n\t  below patches include the following:</p>\n\t  <p>RT 4.0.0 and above are vulnerable to a limited privilege\n\t  escalation leading to unauthorized modification of ticket\n\t  data.  The DeleteTicket right and any custom lifecycle\n\t  transition rights may be bypassed by any user with\n\t  ModifyTicket.  This vulnerability is assigned\n\t  CVE-2012-4733.</p>\n\t  <p>RT 3.8.0 and above include a version of bin/rt that uses\n\t  semi-predictable names when creating tempfiles.  This could\n\t  possibly be exploited by a malicious user to overwrite files\n\t  with permissions of the user running bin/rt.  This\n\t  vulnerability is assigned CVE-2013-3368.</p>\n\t  <p>RT 3.8.0 and above allow calling of arbitrary Mason\n\t  components (without control of arguments) for users who can\n\t  see administration pages.  This could be used by a malicious\n\t  user to run private components which may have negative\n\t  side-effects.  This vulnerability is assigned\n\t  CVE-2013-3369.</p>\n\t  <p>RT 3.8.0 and above allow direct requests to private\n\t  callback components.  Though no callback components ship\n\t  with RT, this could be used to exploit an extension or local\n\t  callback which uses the arguments passed to it insecurely.\n\t  This vulnerability is assigned CVE-2013-3370.</p>\n\t  <p>RT 3.8.3 and above are vulnerable to cross-site scripting\n\t  (XSS) via attachment filenames.  The vector is difficult to\n\t  exploit due to parsing requirements.  Additionally, RT 4.0.0\n\t  and above are vulnerable to XSS via maliciously-crafted\n\t  \"URLs\" in ticket content when RT's \"MakeClicky\" feature is\n\t  configured.  Although not believed to be exploitable in the\n\t  stock configuration, a patch is also included for RTIR 2.6.x\n\t  to add bulletproofing.  These vulnerabilities are assigned\n\t  CVE-2013-3371.</p>\n\t  <p>RT 3.8.0 and above are vulnerable to an HTTP header\n\t  injection limited to the value of the Content-Disposition\n\t  header.  Injection of other arbitrary response headers is\n\t  not possible.  Some (especially older) browsers may allow\n\t  multiple Content-Disposition values which could lead to XSS.\n\t  Newer browsers contain security measures to prevent this.\n\t  Thank you to Dominic Hargreaves for reporting this\n\t  vulnerability.  This vulnerability is assigned\n\t  CVE-2013-3372.</p>\n\t  <p>RT 3.8.0 and above are vulnerable to a MIME header\n\t  injection in outgoing email generated by RT.  The vectors\n\t  via RT's stock templates are resolved by this patchset, but\n\t  any custom email templates should be updated to ensure that\n\t  values interpolated into mail headers do not contain\n\t  newlines.  This vulnerability is assigned CVE-2013-3373.</p>\n\t  <p>RT 3.8.0 and above are vulnerable to limited session\n\t  re-use when using the file-based session store,\n\t  Apache::Session::File.  RT's default session configuration\n\t  only uses Apache::Session::File for Oracle.  RT instances\n\t  using Oracle may be locally configured to use the\n\t  database-backed Apache::Session::Oracle, in which case\n\t  sessions are never re-used.  The extent of session re-use is\n\t  limited to information leaks of certain user preferences and\n\t  caches, such as queue names available for ticket creation.\n\t  Thank you to Jenny Martin for reporting the problem that\n\t  lead to discovery of this vulnerability.  This vulnerability\n\t  is assigned CVE-2013-3374.</p>\n\t</blockquote>\n      "
  },
  "references": {
    "url": [
      "http://lists.bestpractical.com/pipermail/rt-announce/2013-May/000226.html",
      "http://lists.bestpractical.com/pipermail/rt-announce/2013-May/000227.html",
      "http://lists.bestpractical.com/pipermail/rt-announce/2013-May/000228.html"
    ],
    "cvename": [
      "CVE-2012-4733",
      "CVE-2013-3368",
      "CVE-2013-3369",
      "CVE-2013-3370",
      "CVE-2013-3371",
      "CVE-2013-3372",
      "CVE-2013-3373",
      "CVE-2013-3374"
    ]
  },
  "dates": {
    "discovery": "2013-05-22",
    "entry": "2013-05-23"
  }
}
