{
  "vid": "3bb451fc-db64-11e7-ac58-b499baebfeaf",
  "topic": "OpenSSL -- multiple vulnerabilities",
  "affects": [
    {
      "name": [
        "openssl"
      ],
      "range": [
        {
          "lt": "1.0.2n",
          "gt": "1.0.2"
        }
      ]
    }
  ],
  "description": {
    "xmlns": "http://www.w3.org/1999/xhtml",
    "text": "\n\t<p>The OpenSSL project reports:</p>\n\t<blockquote cite=\"https://www.openssl.org/news/secadv/20171207.txt\">\n\t  <ul><li>Read/write after SSL object in error state (CVE-2017-3737)<br/>\n\t    OpenSSL 1.0.2 (starting from version 1.0.2b) introduced an \"error\n\t    state\" mechanism. The intent was that if a fatal error occurred\n\t    during a handshake then OpenSSL would move into the error state and\n\t    would immediately fail if you attempted to continue the handshake.\n\t    This works as designed for the explicit handshake functions\n\t    (SSL_do_handshake(), SSL_accept() and SSL_connect()), however due to\n\t    a bug it does not work correctly if SSL_read() or SSL_write() is\n\t    called directly. In that scenario, if the handshake fails then a\n\t    fatal error will be returned in the initial function call. If\n\t    SSL_read()/SSL_write() is subsequently called by the application for\n\t    the same SSL object then it will succeed and the data is passed\n\t    without being decrypted/encrypted directly from the SSL/TLS record\n\t    layer.</li>\n\t  <li>rsaz_1024_mul_avx2 overflow bug on x86_64 (CVE-2017-3738)<br/>\n\t    There is an overflow bug in the AVX2 Montgomery multiplication\n\t    procedure used in exponentiation with 1024-bit moduli. No EC\n\t    algorithms are affected. Analysis suggests that attacks against\n\t    RSA and DSA as a result of this defect would be very difficult to\n\t    perform and are not believed likely. Attacks against DH1024 are\n\t    considered just feasible, because most of the work necessary to\n\t    deduce information about a private key may be performed offline.\n\t    The amount of resources required for such an attack would be\n\t    significant. However, for an attack on TLS to be meaningful, the\n\t    server would have to share the DH1024 private key among multiple\n\t    clients, which is no longer an option since CVE-2016-0701.</li>\n\t  </ul>\n\t</blockquote>\n      "
  },
  "references": {
    "url": [
      "https://www.openssl.org/news/secadv/20171207.txt"
    ],
    "cvename": [
      "CVE-2017-3737",
      "CVE-2017-3738"
    ]
  },
  "dates": {
    "discovery": "2017-12-07",
    "entry": "2017-12-07"
  }
}
