{
	"vid": "40e2c35e-db99-11ec-b0cf-3065ec8fd3ec",
	"topic": "chromium -- multiple vulnerabilities",
	"affects": [
		{
			"name": [
				"chromium"
			],
			"range": [
				{
					"lt": "102.0.5005.61"
				}
			]
		}
	],
	"description": {
		"xmlns": "http://www.w3.org/1999/xhtml",
		"text": "\n\t<p>Chrome Releases reports:</p>\n\t<blockquote cite=\"https://chromereleases.googleblog.com/2022/05/stable-channel-update-for-desktop_24.html\">\n\t  <p>This release contains 32 security fixes, including:</p>\n\t  <ul>\n\t    <li>[1324864] Critical CVE-2022-1853: Use after free in Indexed DB. Reported by Anonymous on 2022-05-12</li>\n\t    <li>[1320024] High CVE-2022-1854: Use after free in ANGLE. Reported by SeongHwan Park (SeHwa) on 2022-04-27</li>\n\t    <li>[1228661] High CVE-2022-1855: Use after free in Messaging. Reported by Anonymous on 2021-07-13</li>\n\t    <li>[1323239] High CVE-2022-1856: Use after free in User Education. Reported by Nan Wang(@eternalsakura13) and Guang Gong of 360 Alpha Lab on 2022-05-06</li>\n\t    <li>[1227995] High CVE-2022-1857: Insufficient policy enforcement in File System API. Reported by Daniel Rhea on 2021-07-11</li>\n\t    <li>[1314310] High CVE-2022-1858: Out of bounds read in DevTools. Reported by EllisVlad on 2022-04-07</li>\n\t    <li>[1322744] High CVE-2022-1859: Use after free in Performance Manager. Reported by Guannan Wang (@Keenan7310) of Tencent Security Xuanwu Lab on 2022-05-05</li>\n\t    <li>[1297209] High CVE-2022-1860: Use after free in UI Foundations. Reported by @ginggilBesel on 2022-02-15</li>\n\t    <li>[1316846] High CVE-2022-1861: Use after free in Sharing. Reported by Khalil Zhani on 2022-04-16</li>\n\t    <li>[1236325] Medium CVE-2022-1862: Inappropriate implementation in Extensions. Reported by Alesandro Ortiz on 2021-08-04</li>\n\t    <li>[1292870] Medium CVE-2022-1863: Use after free in Tab Groups. Reported by David Erceg on 2022-02-01</li>\n\t    <li>[1320624] Medium CVE-2022-1864: Use after free in WebApp Installs. Reported by Yuntao You (@GraVity0) of Bytedance Wuheng Lab on 2022-04-28</li>\n\t    <li>[1289192] Medium CVE-2022-1865: Use after free in Bookmarks. Reported by Rong Jian of VRI on 2022-01-20</li>\n\t    <li>[1292264] Medium CVE-2022-1866: Use after free in Tablet Mode. Reported by @ginggilBesel on 2022-01-29</li>\n\t    <li>[1315563] Medium CVE-2022-1867: Insufficient validation of untrusted input in Data Transfer. Reported by Michal Bentkowski of Securitum on 2022-04-12</li>\n\t    <li>[1301203] Medium CVE-2022-1868: Inappropriate implementation in Extensions API. Reported by Alesandro Ortiz on 2022-02-28</li>\n\t    <li>[1309467] Medium CVE-2022-1869: Type Confusion in V8. Reported by Man Yue Mo of GitHub Security Lab on 2022-03-23</li>\n\t    <li>[1323236] Medium CVE-2022-1870: Use after free in App Service. Reported by Nan Wang(@eternalsakura13) and Guang Gong of 360 Alpha Lab on 2022-05-06</li>\n\t    <li>[1308199] Low CVE-2022-1871: Insufficient policy enforcement in File System API. Reported by Thomas Orlita on 2022-03-21</li>\n\t    <li>[1310461] Low CVE-2022-1872: Insufficient policy enforcement in Extensions API. Reported by ChaobinZhang on 2022-03-26</li>\n\t    <li>[1305394] Low CVE-2022-1873: Insufficient policy enforcement in COOP. Reported by NDevTK on 2022-03-11</li>\n\t    <li>[1251588] Low CVE-2022-1874: Insufficient policy enforcement in Safe Browsing. Reported by hjy79425575 on 2021-09-21</li>\n\t    <li>[1306443] Low CVE-2022-1875: Inappropriate implementation in PDF. Reported by NDevTK on 2022-03-15</li>\n\t    <li>[1313600] Low CVE-2022-1876: Heap buffer overflow in DevTools. Reported by @ginggilBesel on 2022-04-06</li>\n\t  </ul>\n\t</blockquote>\n      "
	},
	"references": {
		"url": [
			"https://chromereleases.googleblog.com/2022/05/stable-channel-update-for-desktop_24.html"
		],
		"cvename": [
			"CVE-2022-1853",
			"CVE-2022-1854",
			"CVE-2022-1855",
			"CVE-2022-1856",
			"CVE-2022-1857",
			"CVE-2022-1858",
			"CVE-2022-1859",
			"CVE-2022-1860",
			"CVE-2022-1861",
			"CVE-2022-1862",
			"CVE-2022-1863",
			"CVE-2022-1864",
			"CVE-2022-1865",
			"CVE-2022-1866",
			"CVE-2022-1867",
			"CVE-2022-1868",
			"CVE-2022-1869",
			"CVE-2022-1870",
			"CVE-2022-1871",
			"CVE-2022-1872",
			"CVE-2022-1873",
			"CVE-2022-1874",
			"CVE-2022-1875",
			"CVE-2022-1876"
		]
	},
	"dates": {
		"discovery": "2022-05-24",
		"entry": "2022-05-24"
	}
}
