{
	"vid": "46b922a8-c69c-11db-9f82-000e0c2e438a",
	"topic": "FreeBSD -- Jail rc.d script privilege escalation",
	"affects": [
		{
			"name": [
				"FreeBSD"
			],
			"range": [
				{
					"lt": "6.1_12",
					"ge": "6.1"
				},
				{
					"lt": "6.0_17",
					"ge": "6.0"
				},
				{
					"lt": "5.5_15",
					"ge": "5.5"
				}
			]
		}
	],
	"description": {
		"xmlns": "http://www.w3.org/1999/xhtml",
		"text": "\n\t<h1>Problem Description:</h1>\n\t<p>In multiple situations the host's jail rc.d(8) script does\n\t  not check if a path inside the jail file system structure is\n\t  a symbolic link before using the path.  In particular this is\n\t  the case when writing the output from the jail start-up to\n\t  /var/log/console.log and when mounting and unmounting file\n\t  systems inside the jail directory structure.</p>\n\t<h1>Impact:</h1>\n\t<p>Due to the lack of handling of potential symbolic links the\n\t  host's jail rc.d(8) script is vulnerable to \"symlink\n\t  attacks\".  By replacing /var/log/console.log inside the jail\n\t  with a symbolic link it is possible for the superuser (root)\n\t  inside the jail to overwrite files on the host system outside\n\t  the jail with arbitrary content.  This in turn can be used to\n\t  execute arbitrary commands with non-jailed superuser\n\t  privileges.</p>\n\t<p>Similarly, by changing directory mount points inside the\n\t  jail file system structure into symbolic links, it may be\n\t  possible for a jailed attacker to mount file systems which\n\t  were meant to be mounted inside the jail at arbitrary points\n\t  in the host file system structure, or to unmount arbitrary\n\t  file systems on the host system.</p>\n\t<p>NOTE WELL: The above vulnerabilities occur only when a jail\n\t  is being started or stopped using the host's jail rc.d(8)\n\t  script; once started (and until stopped), running jails\n\t  cannot exploit this.</p>\n\t<h1>Workaround:</h1>\n\t<p>If the sysctl(8) variable security.jail.chflags_allowed is\n\t  set to 0 (the default), setting the \"sunlnk\" system flag on\n\t  /var, /var/log, /var/log/console.log, and all file system\n\t  mount points and their parent directories inside the jail(s)\n\t  will ensure that the console log file and mount points are\n\t  not replaced by symbolic links.  If this is done while jails\n\t  are running, the administrator must check that an attacker\n\t  has not replaced any directories with symlinks after setting\n\t  the \"sunlnk\" flag.</p>\n      "
	},
	"references": {
		"cvename": [
			"CVE-2007-0166"
		],
		"freebsd_sa": [
			"SA-07:01.jail"
		]
	},
	"dates": {
		"discovery": "2007-01-11",
		"entry": "2007-02-27",
		"modified": "2016-08-09"
	}
}
