{
	"vid": "5ca064a6-bca1-11ef-8926-9b4f2d14eb53",
	"topic": "forgejo -- multiple vulnerabilities",
	"affects": [
		{
			"name": [
				"forgejo"
			],
			"range": [
				{
					"lt": "9.0.2"
				}
			]
		},
		{
			"name": [
				"forgejo7"
			],
			"range": [
				{
					"lt": "7.0.11"
				}
			]
		}
	],
	"description": {
		"xmlns": "http://www.w3.org/1999/xhtml",
		"text": "\n       <h1>Problem Description:</h1>\n       <ul>\n       <li>It was possible to use a token sent via email for secondary email validation to reset the password instead. In other words, a token sent for a given action (registration, password reset or secondary email validation) could be used to perform a different action. It is no longer possible to use a token for an action that is different from its original purpose.</li>\n       <li>A fork of a public repository would show in the list of forks, even if its owner was not a public user or organization. Such a fork is now hidden from the list of forks of the public repository.</li>\n       <li>The members of an organization team with read access to a repository (e.g. to read issues) but no read access to the code could read the RSS or atom feeds which include the commit activity. Reading the RSS or atom feeds is now denied unless the team has read permissions on the code.</li>\n       <li>The tokens used when replying by email to issues or pull requests were weaker than the rfc2104 recommendations. The tokens are now truncated to 128 bits instead of 80 bits. It is no longer possible to reply to emails sent before the upgrade because the weaker tokens are invalid.</li>\n       <li>A registered user could modify the update frequency of any push mirror (e.g. every 4h instead of every 8h). They are now only able to do that if they have administrative permissions on the repository.</li>\n       <li>It was possible to use basic authorization (i.e. user:password) for requests to the API even when security keys were enrolled for a user. It is no longer possible, an application token must be used instead.</li>\n       <li>Some markup sanitation rules were not as strong as they could be (e.g. allowing emoji somethingelse as well as emoji). The rules are now stricter and do not allow for such cases.</li>\n       <li>When Forgejo is configured to enable instance wide search (e.g. with bleve), results found in the repositories of private or limited users were displayed to anonymous visitors. The results found in private or limited organizations were not displayed. The search results found in the repositories of private or limited user are no longer displayed to anonymous visitors.</li>\n       </ul>\n      "
	},
	"references": {
		"url": [
			"https://codeberg.org/forgejo/forgejo/pulls/5974",
			"https://codeberg.org/forgejo/forgejo/pulls/5974",
			"https://codeberg.org/forgejo/forgejo/pulls/5974",
			"https://codeberg.org/forgejo/forgejo/pulls/5974",
			"https://codeberg.org/forgejo/forgejo/pulls/5974",
			"https://codeberg.org/forgejo/forgejo/pulls/5974",
			"https://codeberg.org/forgejo/forgejo/pulls/5974",
			"https://codeberg.org/forgejo/forgejo/pulls/5974"
		]
	},
	"dates": {
		"discovery": "2024-12-12",
		"entry": "2024-12-17",
		"modified": "2024-12-18"
	}
}
