{
	"vid": "7d53d8da-d07a-11e9-8f1a-001999f8d30b",
	"topic": "asterisk -- Remote Crash Vulnerability in audio transcoding",
	"affects": [
		{
			"name": [
				"asterisk13"
			],
			"range": [
				{
					"lt": "13.28.1"
				}
			]
		},
		{
			"name": [
				"asterisk16"
			],
			"range": [
				{
					"lt": "16.5.1"
				}
			]
		}
	],
	"description": {
		"xmlns": "http://www.w3.org/1999/xhtml",
		"text": "\n\t<p>The Asterisk project reports:</p>\n\t<blockquote cite=\"http://www.asterisk.org/downloads/security-advisories\">\n\t  <p>When audio frames are given to the audio transcoding\n\t  support in Asterisk the number of samples are examined\n\t  and as part of this a message is output to indicate that\n\t  no samples are present. A change was done to suppress\n\t  this message for a particular scenario in which the message\n\t  was not relevant. This change assumed that information\n\t  about the origin of a frame will always exist when in\n\t  reality it may not.</p>\n\t  <p>This issue presented itself when an RTP packet containing\n\t  no audio (and thus no samples) was received. In a particular\n\t  transcoding scenario this audio frame would get turned\n\t  into a frame with no origin information. If this new frame\n\t  was then given to the audio transcoding support a crash\n\t  would occur as no samples and no origin information would\n\t  be present. The transcoding scenario requires the genericplc\n\t  option to be set to enabled (the default) and a transcoding\n\t  path from the source format into signed linear and then\n\t  from signed linear into another format.</p>\n\t  <p>Note that there may be other scenarios that have not\n\t  been found which can cause an audio frame with no origin\n\t  to be given to the audio transcoding support and thus\n\t  cause a crash.</p>\n\t</blockquote>\n      "
	},
	"references": {
		"url": [
			"https://downloads.asterisk.org/pub/security/AST-2019-005.html"
		],
		"cvename": [
			"CVE-2019-15639"
		]
	},
	"dates": {
		"discovery": "2019-08-07",
		"entry": "2019-09-06"
	}
}
