{
  "vid": "81313647-2d03-11d8-9355-0020ed76ef5a",
  "topic": "ElGamal sign+encrypt keys created by GnuPG can be compromised",
  "affects": [
    {
      "name": [
        "gnupg"
      ],
      "range": [
        {
          "lt": "1.2.3_4",
          "ge": "1.0.2"
        }
      ]
    }
  ],
  "description": {
    "xmlns": "http://www.w3.org/1999/xhtml",
    "text": "\n\t<p>Any ElGamal sign+encrypt keys created by GnuPG contain a\n\t  cryptographic weakness that may allow someone to obtain\n\t  the private key. <strong>These keys should be considered\n\t  unusable and should be revoked.</strong></p>\n\t<p>The following summary was written by Werner Koch, GnuPG\n\t  author:</p>\n\t<blockquote cite=\"http://lists.gnupg.org/pipermail/gnupg-devel/2003-November/020570.html\">\n\t  <p>Phong Nguyen identified a severe bug in the way GnuPG\n\t    creates and uses ElGamal keys for signing.\tThis is\n\t    a significant security failure which can lead to a\n\t    compromise of almost all ElGamal keys used for signing.\n\t    Note that this is a real world vulnerability which will\n\t    reveal your private key within a few seconds.</p>\n\t  <p>...</p>\n\t  <p>Please <em>take immediate action and revoke your ElGamal\n\t    signing keys</em>.\tFurthermore you should take whatever\n\t    measures necessary to limit the damage done for signed or\n\t    encrypted documents using that key.</p>\n\t  <p>Note that the standard keys as generated by GnuPG (DSA\n\t    and ElGamal encryption) as well as RSA keys are NOT\n\t    vulnerable.  Note also that ElGamal signing keys cannot\n\t    be generated without the use of a special flag to enable\n\t    hidden options and even then overriding a warning message\n\t    about this key type.  See below for details on how to\n\t    identify vulnerable keys.</p>\n\t</blockquote>\n      "
  },
  "references": {
    "cvename": [
      "CVE-2003-0971"
    ],
    "mlist": [
      {
        "text": "http://lists.gnupg.org/pipermail/gnupg-devel/2003-November/020570.html"
      }
    ]
  },
  "dates": {
    "discovery": "2003-11-27",
    "entry": "2003-12-12"
  }
}
