{
	"vid": "9bd5e47b-6b50-11ef-9a62-002590c1f29c",
	"topic": "FreeBSD -- Multiple issues in ctl(4) CAM Target Layer",
	"affects": [
		{
			"name": [
				"FreeBSD-kernel"
			],
			"range": [
				{
					"lt": "14.1_4",
					"ge": "14.1"
				},
				{
					"lt": "14.0_10",
					"ge": "14.0"
				},
				{
					"lt": "13.3_6",
					"ge": "13.3"
				}
			]
		}
	],
	"description": {
		"xmlns": "http://www.w3.org/1999/xhtml",
		"text": "\n\t<h1>Problem Description:</h1>\n\t<p>Several vulnerabilities were found in the ctl subsystem.</p>\n\t<p>The function ctl_write_buffer incorrectly set a flag which resulted\n\tin a kernel Use-After-Free when a command finished processing\n\t(CVE-2024-45063).  The ctl_write_buffer and ctl_read_buffer functions\n\tallocated memory to be returned to userspace, without initializing\n\tit (CVE-2024-8178).  The ctl_report_supported_opcodes function did\n\tnot sufficiently validate a field provided by userspace, allowing\n\tan arbitrary write to a limited amount of kernel help memory\n\t(CVE-2024-42416).  The ctl_request_sense function could expose up\n\tto three bytes of the kernel heap to userspace (CVE-2024-43110).</p>\n\t<p>Guest virtual machines in the bhyve hypervisor can send SCSI commands\n\tto the corresponding kernel driver via the virtio_scsi interface.\n\tThis provides guests with direct access to the vulnerabilities\n\tcovered by this advisory.</p>\n\t<p>The CAM Target Layer iSCSI target daemon ctld(8) accepts incoming\n\tiSCSI connections, performs authentication and passes connections\n\tto the kernel ctl(4) target layer.</p>\n\t<h1>Impact:</h1>\n\t<p>Malicious software running in a guest VM that exposes virtio_scsi\n\tcan exploit the vulnerabilities to achieve code execution on the\n\thost in the bhyve userspace process, which typically runs as root.\n\tNote that bhyve runs in a Capsicum sandbox, so malicious code is\n\tconstrained by the capabilities available to the bhyve process.</p>\n\t<p>A malicious iSCSI initiator could achieve remote code execution on\n\tthe iSCSI target host.</p>\n      "
	},
	"references": {
		"cvename": [
			"CVE-2024-8178",
			"CVE-2024-42416",
			"CVE-2024-43110"
		],
		"freebsd_sa": [
			"SA-24:11.ctl"
		]
	},
	"dates": {
		"discovery": "2024-09-04",
		"entry": "2024-09-05"
	}
}
