{
	"vid": "abcc5ad3-7e6a-11e7-93f7-d43d7e971a1b",
	"topic": "GitLab -- two vulnerabilities",
	"affects": [
		{
			"name": [
				"gitlab"
			],
			"range": [
				{
					"ge": "7.9.0",
					"le": "8.17.8"
				},
				{
					"ge": "9.0.0",
					"le": "9.0.12"
				},
				{
					"ge": "9.1.0",
					"le": "9.1.9"
				},
				{
					"ge": "9.2.0",
					"le": "9.2.9"
				},
				{
					"ge": "9.3.0",
					"le": "9.3.9"
				},
				{
					"ge": "9.4.0",
					"le": "9.4.3"
				}
			]
		}
	],
	"description": {
		"xmlns": "http://www.w3.org/1999/xhtml",
		"text": "\n\t<p>GitLab reports:</p>\n\t<blockquote cite=\"https://about.gitlab.com/2017/08/10/gitlab-9-dot-4-dot-4-released/\">\n    <h1>Remote Command Execution in git client</h1>\n\t  <p>An external code review performed by Recurity-Labs identified a remote\n\t  command execution vulnerability in git that could be exploited via the \"Repo\n\t  by URL\" import option in GitLab. The command line git client was not\n\t  properly escaping command line arguments in URLs using the SSH protocol\n\t  before invoking the SSH client. A specially crafted URL could be used to\n\t  execute arbitrary shell commands on the GitLab server.<br/>\n    To fully patch this vulnerability two fixes were needed. The Omnibus\n    versions of GitLab contain a patched git client. For source users who may\n    still be running an older version of git, GitLab now also blocks import URLs\n    containing invalid host and usernames.<br/>\n    This issue has been assigned CVE-2017-12426.</p>\n    <h1>Improper sanitization of GitLab export files on import</h1>\n    <p>GitLab versions 8.13.3, 8.12.8, 8.11.10, 8.10.13, and 8.9.12 contained a\n    patch for a critical directory traversal vulnerability in the GitLab export\n    feature that could be exploited by including symlinks in the export file and\n    then re-importing it to a GitLab instance. This vulnerability was patched by\n    checking for and removing symlinks in these files on import.<br/>\n    Recurity-Labs also determined that this fix did not properly remove symlinks for\n    hidden files. Though not as dangerous as the original vulnerability hidden file\n    symlinks could still be used to steal copies of git repositories belonging to\n    other users if the path to the git repository was known by the attacker. An\n    updated fix has been included in these releases that properly removes all\n    symlinks.<br/>\n    This import option was not made available to non-admin users until GitLab\n    8.13.0.</p>\n\t</blockquote>\n      "
	},
	"references": {
		"url": [
			"https://about.gitlab.com/2017/08/10/gitlab-9-dot-4-dot-4-released/"
		],
		"cvename": [
			"CVE-2017-12426"
		]
	},
	"dates": {
		"discovery": "2017-08-10",
		"entry": "2017-08-11"
	}
}
