{
	"vid": "d7efc2ad-37af-11ef-b611-84a93843eb75",
	"topic": "Apache httpd -- Multiple vulnerabilities",
	"affects": [
		{
			"name": [
				"apache24"
			],
			"range": [
				{
					"lt": "2.4.60"
				}
			]
		}
	],
	"description": {
		"xmlns": "http://www.w3.org/1999/xhtml",
		"text": "\n\t<p>The Apache httpd project reports:</p>\n\t<blockquote cite=\"https://httpd.apache.org/security/vulnerabilities_24.html\">\n\t  <p>DoS by Null pointer in websocket over HTTP/2 (CVE-2024-36387) (Low).\n\t    Serving WebSocket protocol upgrades over a HTTP/2 connection could\n\t    result in a Null Pointer dereference, leading to a crash of the server\n\t    process, degrading performance.</p>\n\t  <p>Proxy encoding problem (CVE-2024-38473) (Moderate).\n\t    Encoding problem in mod_proxy in Apache HTTP Server 2.4.59 and earlier\n\t    allows request URLs with incorrect encoding to be sent to backend\n\t    services, potentially bypassing authentication via crafted requests.</p>\n\t  <p>Weakness with encoded question marks in backreferences\n\t    (CVE-2024-38474) (Important). Substitution encoding issue in\n\t    mod_rewrite in Apache HTTP Server 2.4.59 and earlier allows attacker\n\t    to execute scripts in directories permitted by the configuration but\n\t    not directly reachable by any URL or source disclosure of scripts\n\t    meant to only to be executed as CGI.</p>\n\t  <p>Weakness in mod_rewrite when first segment of substitution matches\n\t    filesystem path (CVE-2024-38475) (Important). Improper escaping of\n\t    output in mod_rewrite in Apache HTTP Server 2.4.59 and earlier allows\n\t    an attacker to map URLs to filesystem locations that are permitted to\n\t    be served by the server but are not intentionally/directly reachable\n\t    by any URL, resulting in code execution or source code disclosure.\n\t    Substitutions in server context that use a backreferences or variables\n\t    as the first segment of the substitution are affected. Some unsafe\n\t    RewiteRules will be broken by this change and the rewrite flag\n\t    \"UnsafePrefixStat\" can be used to opt back in once ensuring the\n\t    substitution is appropriately constrained.</p>\n\t  <p>may use exploitable/malicious backend application output to run local\n\t    handlers via internal redirect (CVE-2024-38476) (Important).\n\t    Vulnerability in core of Apache HTTP Server 2.4.59 and earlier are\n\t    vulnerable to information disclosure, SSRF or local script execution\n\t    via backend applications whose response headers are malicious or\n\t    exploitable.</p>\n\t  <p>Crash resulting in Denial of Service in mod_proxy via a malicious\n\t    request (CVE-2024-38477) (Important). Null pointer dereference in\n\t    mod_proxy in Apache HTTP Server 2.4.59 and earlier allows an attacker\n\t    to crash the server via a malicious request.</p>\n\t  <p>mod_rewrite proxy handler substitution (CVE-2024-39573) (Moderate).\n\t    Potential SSRF in mod_rewrite in Apache HTTP Server 2.4.59 and earlier\n\t    allows an attacker to cause unsafe RewriteRules to unexpectedly setup\n\t    URL's to be handled by mod_proxy.</p>\n\t</blockquote>\n\t"
	},
	"references": {
		"url": [
			"https://httpd.apache.org/security/vulnerabilities_24.html"
		],
		"cvename": [
			"CVE-2024-36387",
			"CVE-2024-38473",
			"CVE-2024-38474",
			"CVE-2024-38475",
			"CVE-2024-38476",
			"CVE-2024-38477",
			"CVE-2024-39573"
		]
	},
	"dates": {
		"discovery": "2024-07-01",
		"entry": "2024-07-01"
	}
}
